# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.

import random
n = int(input("Введите количество монет: "))
reshka = random.randint(1, n - 1)
gerb = n - reshka
print(f"Монет повернуто гербом: {gerb}.")
print(f"Монет повернуто решкой: {reshka}.")
if gerb < reshka:
    print(f"Нужно перевернуть {gerb} монет с гербом.")
else:
    print(f"Нужно перевернуть {reshka} монет с решкой.")