# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.

n = int(input("Введите число N: "))
count = 0
while 2 ** count < n:
    print(f"2 в степени {count} = {2 ** count}.")
    count += 1